samiamewerks/mgm13_bootstrap/platform/emdrv/rtcdrv/src/rtcdriver.c
// Default to LFXO unless configured for LFRCO.
#if defined(EMDRV_RTCDRV_USE_LFRCO)
  #define RTCDRV_OSC cmuSelect_LFRCO
#else
  #define RTCDRV_OSC cmuSelect_LFXO
#endif

static void checkAllTimers(uint32_t timeElapsed);
static void delayTicks(uint32_t ticks);
static void executeTimerCallbacks(void);
static void rescheduleRtc(uint32_t rtcCnt);
#if defined(EMDRV_RTCDRV_WALLCLOCK_CONFIG)
static void handleOverflow(void);
#endif

/// @endcond

/***************************************************************************//**
 * @brief
 *    Allocate timer.
 *
 * @details
 *    Reserve a timer instance.
 *
 * @param[out] id The ID of the reserved timer.
 *
 * @return
 *    @ref ECODE_EMDRV_RTCDRV_OK on success.@n
 *    @ref ECODE_EMDRV_RTCDRV_ALL_TIMERS_USED when no timers are available.@n
 *    @ref ECODE_EMDRV_RTCDRV_PARAM_ERROR if an invalid ID pointer was supplied.@n
 *    @ref ECODE_EMDRV_RTCDRV_NOT_INITIALIZED if the driver is not initialized.
 ******************************************************************************/
Ecode_t RTCDRV_AllocateTimer(RTCDRV_TimerID_t *id)
{
  CORE_DECLARE_IRQ_STATE;
  int i      = 0;
  Ecode_t retVal = 0;

  // Check if driver is initialized.
  if ( rtcdrvIsInitialized == false ) {
    return ECODE_EMDRV_RTCDRV_NOT_INITIALIZED;
  }

  CORE_ENTER_ATOMIC();
  // Iterate through the table of the timers until the first available.
  while ( (i < EMDRV_RTCDRV_NUM_TIMERS) && (timer[i].allocated) ) {
    i++;
  }

  // Check if the end of the table is reached.
  if ( i == EMDRV_RTCDRV_NUM_TIMERS ) {
    retVal = ECODE_EMDRV_RTCDRV_ALL_TIMERS_USED;
  } else {
    // Check if a NULL pointer was passed.
    if ( id != NULL ) {
      timer[i].allocated = true;
      *id = i;
      retVal = ECODE_EMDRV_RTCDRV_OK;
    } else {
      retVal = ECODE_EMDRV_RTCDRV_PARAM_ERROR;
    }
  }
  CORE_EXIT_ATOMIC();

  return retVal;
}

/***************************************************************************//**
 * @brief
 *    Millisecond delay function.
 *
 * @param[in] ms Milliseconds to stay in the delay function.
 *
 * @return
 *    @ref ECODE_EMDRV_RTCDRV_OK on success.@n
 *    @ref ECODE_EMDRV_RTCDRV_NOT_INITIALIZED if the driver is not initialized.
 ******************************************************************************/
Ecode_t RTCDRV_Delay(uint32_t ms)
{
  uint64_t totalTicks;

  // Check if driver is initialized.
  if ( rtcdrvIsInitialized == false ) {
    return ECODE_EMDRV_RTCDRV_NOT_INITIALIZED;
  }

  totalTicks = MSEC_TO_TICKS(ms);

  while ( totalTicks > RTC_CLOSE_TO_MAX_VALUE ) {
    delayTicks(RTC_CLOSE_TO_MAX_VALUE);
    totalTicks -= RTC_CLOSE_TO_MAX_VALUE;
  }
  delayTicks(totalTicks);

  return ECODE_EMDRV_RTCDRV_OK;
}

/***************************************************************************//**
 * @brief
 *    Free timer.
 *
 * @details
 *    Release a reserved timer.
 *
 * @param[out] id The ID of the timer to release.
 *
 * @return
 *    @ref ECODE_EMDRV_RTCDRV_OK on success.@n
 *    @ref ECODE_EMDRV_RTCDRV_ILLEGAL_TIMER_ID if the ID has an illegal value.
 ******************************************************************************/
Ecode_t RTCDRV_FreeTimer(RTCDRV_TimerID_t id)
{
  // Check if valid timer ID.
  if ( id >= EMDRV_RTCDRV_NUM_TIMERS ) {
    return ECODE_EMDRV_RTCDRV_ILLEGAL_TIMER_ID;
  }

  CORE_ATOMIC_SECTION(
    timer[id].running   = false;
    timer[id].allocated = false;
    )

  return ECODE_EMDRV_RTCDRV_OK;
}

/***************************************************************************//**
 * @brief
 *    Initialize the RTCDRV driver.
 *
 * @details
 *    Will enable all necessary clocks. Initializes internal data structures
 *    and configures the underlying hardware timer.
 *
 * @return
 *    @ref ECODE_EMDRV_RTCDRV_OK.
 ******************************************************************************/
Ecode_t RTCDRV_Init(void)
{

  if ( rtcdrvIsInitialized == true ) {
    return ECODE_EMDRV_RTCDRV_OK;
  }

#if defined(cmuClock_CORELE)
  // Ensure LE modules are clocked.
  CMU_ClockEnable(cmuClock_CORELE, true);
#endif

#if defined(CMU_LFECLKEN0_RTCC)
  // Enable LFECLK in CMU (will also enable oscillator if not enabled).
  CMU_ClockSelectSet(cmuClock_LFE, RTCDRV_OSC);
#else
#if defined(_SILICON_LABS_32B_SERIES_2)
  CMU_ClockSelectSet(cmuClock_RTCC, RTCDRV_OSC);
#else
  // Enable LFACLK in CMU (will also enable oscillator if not enabled).
  CMU_ClockSelectSet(cmuClock_LFA, RTCDRV_OSC);
#endif
#endif


#if defined(RTCDRV_USE_RTC)
  // Set clock divider.
  CMU_ClockDivSet(cmuClock_RTC, RTC_DIVIDER);

  // Enable RTC module clock.
  CMU_ClockEnable(cmuClock_RTC, true);

  // Initialize RTC.
  RTC_Init(&initRTC);

#elif defined(RTCDRV_USE_RTCC)
  // Set clock divider.
#if defined(_SILICON_LABS_32B_SERIES_2)
  initRTCC.presc = (RTCC_CntPresc_TypeDef)(31UL - __CLZ(RTC_DIVIDER));
#else
  initRTCC.presc = (RTCC_CntPresc_TypeDef)CMU_DivToLog2(RTC_DIVIDER);
#endif

  // Enable RTCC module clock.
  CMU_ClockEnable(cmuClock_RTCC, true);

  // Initialize RTCC.
  RTCC_Init(&initRTCC);

  // Set up compare channel.
  RTCC_ChannelInit(1, &initRTCCCompareChannel);
#endif

  // Disable RTC/RTCC interrupt generation.
  RTC_INTDISABLE(RTC_ALL_INTS);
  RTC_INTCLEAR(RTC_ALL_INTS);

  RTC_COUNTERRESET();

  // Clear and then enable RTC interrupts in NVIC.
  NVIC_CLEARPENDINGIRQ();
  NVIC_ENABLEIRQ();

#if defined(EMDRV_RTCDRV_WALLCLOCK_CONFIG)
  // Enable overflow interrupt for wallclock.
  RTC_INTENABLE(RTC_OF_INT);
#endif

  // Reset RTCDRV internal data structures/variables.
  memset(timer, 0, sizeof(timer) );
  inTimerIRQ             = false;
  rtcRunning             = false;
  startTimerNestingLevel = 0;
#if defined(EMODE_DYNAMIC)
  sleepBlocked           = false;
#endif

#if defined(EMDRV_RTCDRV_WALLCLOCK_CONFIG)
  wallClockOverflowCnt = 0;
  wallClockTimeBase    = 0;

#if defined(EMODE_NEVER_ALLOW_EM3EM4)
  // Always block EM3 and EM4 if wallclock is running.
  SLEEP_SleepBlockBegin(sleepEM3);
#endif

#endif

  rtcdrvIsInitialized = true;
#if defined(_SILICON_LABS_32B_SERIES_2)
  RTCC_SyncWait();
#endif
  return ECODE_EMDRV_RTCDRV_OK;
}

/***************************************************************************//**
 * @brief
 *    Deinitialize the RTCDRV driver.
 *
 * @details
 *    Will disable interrupts and turn off the clock to the underlying hardware
 *    timer.
 *    If the integration with the SLEEP module is enabled, it will remove any
 *    restrictions that are set on energy mode usage.
 *
 * @return
 *    @ref ECODE_EMDRV_RTCDRV_OK.
 ******************************************************************************/
Ecode_t RTCDRV_DeInit(void)
{
  // Mark the driver as uninitialized.
  rtcdrvIsInitialized = false;

  // Disable and clear all interrupt sources.
  NVIC_DISABLEIRQ();
  RTC_INTDISABLE(RTC_ALL_INTS);
  RTC_INTCLEAR(RTC_ALL_INTS);
  NVIC_CLEARPENDINGIRQ();

  // Disable RTC module and its clock.
#if defined(RTCDRV_USE_RTC)
  RTC_Enable(false);
  CMU_ClockEnable(cmuClock_RTC, false);
#elif defined(RTCDRV_USE_RTCC)
  RTCC_Enable(false);
  CMU_ClockEnable(cmuClock_RTCC, false);
#endif

#if defined(EMODE_NEVER_ALLOW_EM3EM4)
  // End EM3 and EM4 blocking.
  SLEEP_SleepBlockEnd(sleepEM3);
#endif

#if defined(EMODE_DYNAMIC)
  // End EM3 and EM4 blocking if a block start has been set.
  if ( sleepBlocked ) {
    SLEEP_SleepBlockEnd(sleepEM3);
  }
#endif

  return ECODE_EMDRV_RTCDRV_OK;
}

/***************************************************************************//**
 * @brief
 *    Check if a given timer is running.
 *
 * @param[in] id The ID of the timer to query.
 *
 * @param[out] isRunning True if the timer is running. False if not running.
 *                       Only valid if return status is ECODE_EMDRV_RTCDRV_OK.
 *
 * @return
 *    @ref ECODE_EMDRV_RTCDRV_OK on success.@n
 *    @ref ECODE_EMDRV_RTCDRV_ILLEGAL_TIMER_ID if the ID has an illegal value. @n
 *    @ref ECODE_EMDRV_RTCDRV_TIMER_NOT_ALLOCATED if the timer is not reserved.@n
 *    @ref ECODE_EMDRV_RTCDRV_PARAM_ERROR if an invalid isRunning pointer was
 *         supplied.@n
 *    @ref ECODE_EMDRV_RTCDRV_NOT_INITIALIZED if the driver is not initialized.
 ******************************************************************************/
Ecode_t RTCDRV_IsRunning(RTCDRV_TimerID_t id, bool *isRunning)
{
  CORE_DECLARE_IRQ_STATE;

  // Check if driver is initialized.
  if ( rtcdrvIsInitialized == false ) {
    return ECODE_EMDRV_RTCDRV_NOT_INITIALIZED;
  }

  // Check if valid timer ID.
  if ( id >= EMDRV_RTCDRV_NUM_TIMERS ) {
    return ECODE_EMDRV_RTCDRV_ILLEGAL_TIMER_ID;
  }

