samiamewerks/mgm13_bootstrap/platform/emdrv/rtcdrv/src/rtcdriver.c
  // Check pointer validity.
  if ( isRunning == NULL ) {
    return ECODE_EMDRV_RTCDRV_PARAM_ERROR;
  }

  CORE_ENTER_ATOMIC();
  // Check if the timer is reserved.
  if ( !timer[id].allocated ) {
    CORE_EXIT_ATOMIC();
    return ECODE_EMDRV_RTCDRV_TIMER_NOT_ALLOCATED;
  }
  *isRunning = timer[id].running;
  CORE_EXIT_ATOMIC();

  return ECODE_EMDRV_RTCDRV_OK;
}

/***************************************************************************//**
 * @brief
 *    Start a timer.
 *
 * @note
 *    It is legal to start an already running timer.
 *
 * @param[in] id The ID of the timer to start.
 * @param[in] type Timer type, oneshot or periodic. See @ref RTCDRV_TimerType_t.
 * @param[in] timeout Timeout expressed in milliseconds. If the timeout value
 *            is 0, the callback function is called immediately and
 *            the timer will not be started.
 * @param[in] callback Function to call when the timer expires. See @ref
 *            RTCDRV_Callback_t. NULL is a legal value.
 * @param[in] user Extra callback function parameter for the user application.
 *
 * @return
 *    @ref ECODE_EMDRV_RTCDRV_OK on success.@n
 *    @ref ECODE_EMDRV_RTCDRV_ILLEGAL_TIMER_ID if the ID has an illegal value.@n
 *    @ref ECODE_EMDRV_RTCDRV_TIMER_NOT_ALLOCATED if the timer is not reserved.@n
 *    @ref ECODE_EMDRV_RTCDRV_NOT_INITIALIZED if the driver is not initialized.
 ******************************************************************************/
Ecode_t RTCDRV_StartTimer(RTCDRV_TimerID_t id,
                          RTCDRV_TimerType_t type,
                          uint32_t timeout,
                          RTCDRV_Callback_t callback,
                          void *user)
{
  CORE_DECLARE_IRQ_STATE;

  uint32_t timeElapsed, cnt, compVal, loopCnt = 0;
  uint32_t timeToNextTimerCompletion;

  // Check if driver is initialized.
  if ( rtcdrvIsInitialized == false ) {
    return ECODE_EMDRV_RTCDRV_NOT_INITIALIZED;
  }

  // Check if valid timer ID.
  if ( id >= EMDRV_RTCDRV_NUM_TIMERS ) {
    return ECODE_EMDRV_RTCDRV_ILLEGAL_TIMER_ID;
  }

  CORE_ENTER_ATOMIC();
  if ( !timer[id].allocated ) {
    CORE_EXIT_ATOMIC();
    return ECODE_EMDRV_RTCDRV_TIMER_NOT_ALLOCATED;
  }

  if ( timeout == 0 ) {
    if ( callback != NULL ) {
      callback(id, user);
    }
    CORE_EXIT_ATOMIC();
    return ECODE_EMDRV_RTCDRV_OK;
  }

  cnt = RTC_COUNTERGET();

  timer[id].callback  = callback;
  timer[id].ticks     = MSEC_TO_TICKS(timeout);
  if (rtcdrvTimerTypePeriodic == type) {
    // Calculate compensation value for periodic timers.
    timer[id].periodicCompensationUsec = 1000 * timeout
                                         - (timer[id].ticks * TICK_TIME_USEC);
    timer[id].periodicDriftUsec = TICK_TIME_USEC / 2;
  } else {
    // Compensate for the fact that CNT is normally COMP0+1 after a
    // compare match event on some devices.
    timer[id].ticks -= RTC_ONESHOT_TICK_ADJUST;
  }
  // Add one tick to compensate if RTC is close to an increment event.
  timer[id].remaining = timer[id].ticks + 1;
  timer[id].running   = true;
  timer[id].timerType = type;
  timer[id].user      = user;

  if ( inTimerIRQ == true ) {
    // Exit now, remaining processing will be done in IRQ handler.
    CORE_EXIT_ATOMIC();
    return ECODE_EMDRV_RTCDRV_OK;
  }

  // StartTimer() may recurse, keep track of recursion level.
  if ( startTimerNestingLevel < UINT32_MAX ) {
    startTimerNestingLevel++;
  }

  if ( rtcRunning == false ) {
#if defined(RTCDRV_USE_RTC)
    lastStart = (cnt) & RTC_COUNTER_MASK;
#elif defined(RTCDRV_USE_RTCC)
    lastStart = cnt;
#endif

    RTC_INTCLEAR(RTC_COMP_INT);

    compVal = SL_MIN(timer[id].remaining, RTC_CLOSE_TO_MAX_VALUE);
    RTC_COMPARESET(cnt + compVal);

    // Start the timer system by enabling the compare interrupt.
    RTC_INTENABLE(RTC_COMP_INT);

#if defined(EMODE_DYNAMIC)
    // When RTC is running, EM3 or EM4 is not allowed.
    if ( sleepBlocked == false ) {
      sleepBlocked = true;
      SLEEP_SleepBlockBegin(sleepEM3);
    }
#endif

    rtcRunning = true;
  } else {
    // The timer system is running. It must stop, timers must be updated with the time
    // elapsed so far, the timer with the shortest timeout must be found, and the system restarted.
    // As StartTimer() may be called from the callbacks. This
    // processing is only done at the first nesting level.
    if ( startTimerNestingLevel == 1  ) {
      timer[id].running = false;
      // This loop is repeated if CNT is incremented while processing.
      do {
        RTC_INTDISABLE(RTC_COMP_INT);

        timeElapsed = TIMEDIFF(cnt, lastStart);
#if defined(RTCDRV_USE_RTC)
        // Compensate for the fact that CNT is normally COMP0+1 after a
        // compare match event.
        if ( timeElapsed == RTC_MAX_VALUE ) {
          timeElapsed = 0;
        }
#endif

        // Update all timers with elapsed time.
        checkAllTimers(timeElapsed);

        // Execute timer callbacks.
        executeTimerCallbacks();

        // Set timer to running only after checkAllTimers() is called once.
        if ( loopCnt == 0 ) {
          timer[id].running = true;
        }
        loopCnt++;

        // Restart RTC according to the next timeout.
        rescheduleRtc(cnt);

        cnt = RTC_COUNTERGET();
        timeElapsed = TIMEDIFF(cnt, lastStart);
        timeToNextTimerCompletion = TIMEDIFF(RTC_COMPAREGET(), lastStart);

        /* If the counter has passed the COMP(ARE) register value since
           the timers were checked, recheck the timers and
           reschedule. */
      } while ( rtcRunning && (timeElapsed >= timeToNextTimerCompletion));
    }
  }

  if ( startTimerNestingLevel > 0 ) {
    startTimerNestingLevel--;
  }

  CORE_EXIT_ATOMIC();
  return ECODE_EMDRV_RTCDRV_OK;
}

/***************************************************************************//**
 * @brief
 *    Stop a given timer.
 *
 * @param[in] id The ID of the timer to stop.
 *
 * @return
 *    @ref ECODE_EMDRV_RTCDRV_OK on success.@n
 *    @ref ECODE_EMDRV_RTCDRV_ILLEGAL_TIMER_ID if the ID has an illegal value. @n
 *    @ref ECODE_EMDRV_RTCDRV_TIMER_NOT_ALLOCATED if the timer is not reserved.@n
 *    @ref ECODE_EMDRV_RTCDRV_NOT_INITIALIZED if the driver is not initialized.
 ******************************************************************************/
Ecode_t RTCDRV_StopTimer(RTCDRV_TimerID_t id)
{
  CORE_DECLARE_IRQ_STATE;

  // Check if driver is initialized.
  if ( rtcdrvIsInitialized == false ) {
    return ECODE_EMDRV_RTCDRV_NOT_INITIALIZED;
  }

  // Check if valid timer ID.
  if ( id >= EMDRV_RTCDRV_NUM_TIMERS ) {
    return ECODE_EMDRV_RTCDRV_ILLEGAL_TIMER_ID;
  }

