samiamewerks/mgm13_bootstrap/platform/emdrv/rtcdrv/src/rtcdriver.c
  CORE_ENTER_ATOMIC();
  if ( !timer[id].allocated ) {
    CORE_EXIT_ATOMIC();
    return ECODE_EMDRV_RTCDRV_TIMER_NOT_ALLOCATED;
  }

  timer[id].running = false;
  CORE_EXIT_ATOMIC();

  return ECODE_EMDRV_RTCDRV_OK;
}

/***************************************************************************//**
 * @brief
 *    Get time left before a given timer expires.
 *
 * @param[in] id The ID of the timer to query.
 *
 * @param[out] timeRemaining Time left expressed in milliseconds.
 *                        Only valid if the return status is ECODE_EMDRV_RTCDRV_OK.
 * @return
 *    @ref ECODE_EMDRV_RTCDRV_OK on success.@n
 *    @ref ECODE_EMDRV_RTCDRV_ILLEGAL_TIMER_ID if the ID has an illegal value. @n
 *    @ref ECODE_EMDRV_RTCDRV_TIMER_NOT_ALLOCATED if the timer is not reserved.@n
 *    @ref ECODE_EMDRV_RTCDRV_TIMER_NOT_RUNNING if the timer is not running.@n
 *    @ref ECODE_EMDRV_RTCDRV_PARAM_ERROR if an invalid timeRemaining pointer
 *         was supplied.@n
 *    @ref ECODE_EMDRV_RTCDRV_NOT_INITIALIZED if the driver is not initialized.
 ******************************************************************************/
Ecode_t RTCDRV_TimeRemaining(RTCDRV_TimerID_t id, uint32_t *timeRemaining)
{
  CORE_DECLARE_IRQ_STATE;
  uint64_t ticksLeft;
  uint32_t currentCnt, lastRtcStart;

  // Check if driver is initialized.
  if ( rtcdrvIsInitialized == false ) {
    return ECODE_EMDRV_RTCDRV_NOT_INITIALIZED;
  }

  // Check if valid timer ID.
  if ( id >= EMDRV_RTCDRV_NUM_TIMERS ) {
    return ECODE_EMDRV_RTCDRV_ILLEGAL_TIMER_ID;
  }

  // Check pointer validity.
  if ( timeRemaining == NULL ) {
    return ECODE_EMDRV_RTCDRV_PARAM_ERROR;
  }

  CORE_ENTER_ATOMIC();
  // Check if timer is reserved.
  if ( !timer[id].allocated ) {
    CORE_EXIT_ATOMIC();
    return ECODE_EMDRV_RTCDRV_TIMER_NOT_ALLOCATED;
  }

  // Check if timer is running.
  if ( !timer[id].running ) {
    CORE_EXIT_ATOMIC();
    return ECODE_EMDRV_RTCDRV_TIMER_NOT_RUNNING;
  }

  ticksLeft    = timer[id].remaining;
  currentCnt   = RTC_COUNTERGET();
  lastRtcStart = lastStart;
  CORE_EXIT_ATOMIC();

  // Get number of RTC clock ticks elapsed since last RTC reschedule.
  currentCnt = TIMEDIFF(currentCnt, lastRtcStart);

  if ( currentCnt > ticksLeft ) {
    ticksLeft = 0;
  } else {
    ticksLeft -= currentCnt;
  }

  *timeRemaining = TICKS_TO_MSEC(ticksLeft);

  return ECODE_EMDRV_RTCDRV_OK;
}

#if defined(EMDRV_RTCDRV_WALLCLOCK_CONFIG)
/***************************************************************************//**
 * @brief
 *    Get wallclock time.
 *
 * @return
 *    Seconds elapsed since RTCDRV was initialized.
 ******************************************************************************/
uint32_t RTCDRV_GetWallClock(void)
{
  return wallClockTimeBase
         + (uint32_t)TICKS_TO_SEC(RTCDRV_GetWallClockTicks32() );
}
#endif

#if defined(EMDRV_RTCDRV_WALLCLOCK_CONFIG)
/***************************************************************************//**
 * @brief
 *    Get wallclock tick count as a 32bit value. At 4 ticks per millisecond,
 *    overflow occurs after approximately 12.5 days.
 *
 * @detail
 *    The return value of this function is in counter ticks. Use
 *    @ref RTCDRV_TicksToMsec() or @ref RTCDRV_TicksToSec() to convert ticks
 *    to the desired time unit.
 *
 * @return
 *    A wallclock tick counter.
 ******************************************************************************/
uint32_t RTCDRV_GetWallClockTicks32(void)
{
#if (RTC_COUNTER_BITS == 32)
  return RTC_COUNTERGET();
#else
  CORE_DECLARE_IRQ_STATE;
  uint32_t overflows, ticks;

  /* Need to re-read data in case overflow cnt is incremented while we read. */
  CORE_ENTER_ATOMIC();
  do {
    overflows = wallClockOverflowCnt;
    ticks     = RTC_COUNTERGET();
    handleOverflow();
  } while ( overflows != wallClockOverflowCnt );
  CORE_EXIT_ATOMIC();

  return (overflows << RTC_COUNTER_BITS) + ticks;
#endif
}
#endif

#if defined(EMDRV_RTCDRV_WALLCLOCK_CONFIG)
/***************************************************************************//**
 * @brief
 *    Get a wallclock tick count as a 64 bit value.
 *
 * @detail
 *    The return value of this function is in counter ticks. Use
 *    @ref RTCDRV_TicksToMsec64() or @ref RTCDRV_TicksToSec() to convert ticks
 *    to the desired time unit.
 *
 * @return
 *    A wallclock tick counter.
 ******************************************************************************/
uint64_t RTCDRV_GetWallClockTicks64(void)
{
  CORE_DECLARE_IRQ_STATE;
  uint64_t overflows, ticks;

  /* Need to re-read data if the overflow cnt is incremented while reading. */
  CORE_ENTER_ATOMIC();
  do {
    overflows = wallClockOverflowCnt;
    ticks     = RTC_COUNTERGET();
    handleOverflow();
  } while ( overflows != wallClockOverflowCnt );
  CORE_EXIT_ATOMIC();

  return (overflows << RTC_COUNTER_BITS) + ticks;
}
#endif

#if defined(EMDRV_RTCDRV_WALLCLOCK_CONFIG)
/***************************************************************************//**
 * @brief
 *    Set wallclock time.
 *
 * @param[in] secs A value to set (seconds).
 *
 * @return
 *    @ref ECODE_EMDRV_RTCDRV_OK
 ******************************************************************************/
Ecode_t RTCDRV_SetWallClock(uint32_t secs)
{
  wallClockTimeBase = secs - TICKS_TO_SEC(RTCDRV_GetWallClockTicks32() );
  return ECODE_EMDRV_RTCDRV_OK;
}
#endif

#if defined(EMDRV_RTCDRV_WALLCLOCK_CONFIG)
/***************************************************************************//**
 * @brief
 *    Convert from milliseconds to RTC/RTCC ticks.
 *
 * @param[in] ms Millisecond value to convert.
 *
 * @return
 *    A number of ticks.
 ******************************************************************************/
uint64_t  RTCDRV_MsecsToTicks(uint32_t ms)
{
  return MSEC_TO_TICKS(ms);
}
#endif

#if defined(EMDRV_RTCDRV_WALLCLOCK_CONFIG)
/***************************************************************************//**
 * @brief
 *    Convert from seconds to RTC/RTCC ticks.
 *
 * @param[in] secs Second value to convert.
 *
 * @return
 *    A number of ticks.
 ******************************************************************************/
uint64_t  RTCDRV_SecsToTicks(uint32_t secs)
{
  return MSEC_TO_TICKS(1000 * secs);
}
#endif

#if defined(EMDRV_RTCDRV_WALLCLOCK_CONFIG)
/***************************************************************************//**
 * @brief
 *    Convert from RTC/RTCC ticks to milliseconds.
 *
 * @param[in] ticks Number of ticks to convert.
 *
 * @return
 *   A number of milliseconds.
 ******************************************************************************/
uint32_t  RTCDRV_TicksToMsec(uint64_t ticks)
{
  return TICKS_TO_MSEC(ticks);
}

/***************************************************************************//**
 * @brief
 *    Convert from RTC/RTCC ticks to milliseconds with 64-bit resolution.
 *
 * @param[in] ticks Number of ticks to convert.
 *
 * @return
 *   A number of milliseconds as a 64-bit value.
 ******************************************************************************/
uint64_t  RTCDRV_TicksToMsec64(uint64_t ticks)
{
  return TICKS_TO_MSEC(ticks);
}
#endif

#if defined(EMDRV_RTCDRV_WALLCLOCK_CONFIG)
/***************************************************************************//**
 * @brief
 *    Convert from RTC/RTCC ticks to seconds.
 *
 * @param[in] ticks Number of ticks to convert.
 *
 * @return
 *    A number of seconds.
 ******************************************************************************/
uint32_t  RTCDRV_TicksToSec(uint64_t ticks)
{
  return TICKS_TO_MSEC(ticks) / 1000;
}
#endif

