samiamewerks/mgm13_bootstrap/platform/emdrv/rtcdrv/src/rtcdriver.c
/// @cond DO_NOT_INCLUDE_WITH_DOXYGEN

#if defined(RTCDRV_USE_RTC)
void RTC_IRQHandler(void)
#elif defined(RTCDRV_USE_RTCC)
void RTCC_IRQHandler(void)
#endif
{
  CORE_DECLARE_IRQ_STATE;
  uint32_t flags, timeElapsed, cnt, timeToNextTimerCompletion;

  CORE_ENTER_ATOMIC();

  // CNT will normally be COMP0+1 at this point,
  // unless IRQ latency exceeded one tick period.

  flags = RTC_INTGET();

  // Acknowledge all RTC interrupts that are enabled which aren't processed
  // below to prevent looping in the IRQ handler if these become enabled.
  RTC_INTCLEAR(flags & ~(RTC_COMP_INT | RTC_OF_INT));

  if ( flags & RTC_COMP_INT ) {
    // Stop timer system by disabling the compare IRQ.
    // Update all timers with the time elapsed, call callbacks if needed,
    // then find the timer with the shortest timeout (if any at all) and
    // reenable the compare IRQ if needed.

    inTimerIRQ = true;

    cnt = RTC_COUNTERGET();

    // This loop is repeated if CNT is incremented while processing.
    do {
      RTC_INTDISABLE(RTC_COMP_INT);

      timeElapsed = TIMEDIFF(cnt, lastStart);

      // Update all timers with elapsed time.
      checkAllTimers(timeElapsed);

      // Execute timer callbacks.
      executeTimerCallbacks();

      // Restart RTC according to next timeout.
      rescheduleRtc(cnt);

      cnt = RTC_COUNTERGET();
      timeElapsed = TIMEDIFF(cnt, lastStart);
      timeToNextTimerCompletion = TIMEDIFF(RTC_COMPAREGET(), lastStart);
      /* If the counter has passed the COMP(ARE) register value since
         the timers were checked, recheck the timers and
         reschedule. */
    } while ( rtcRunning && (timeElapsed >= timeToNextTimerCompletion));
    inTimerIRQ = false;
  }

#if defined(EMDRV_RTCDRV_WALLCLOCK_CONFIG)
  handleOverflow();
#endif

  CORE_EXIT_ATOMIC();
}

static void checkAllTimers(uint32_t timeElapsed)
{
  int i;
#if defined(EMODE_DYNAMIC)
  int numOfTimersRunning = 0;
#endif

  // Iterate through the timer table.
  // Update time remaining, check for timeout and rescheduling of periodic
  // timers, check for callbacks.

  for ( i = 0; i < EMDRV_RTCDRV_NUM_TIMERS; i++ ) {
    timer[i].doCallback = false;
    if ( timer[i].running == true ) {
#if defined(EMODE_DYNAMIC)
      numOfTimersRunning++;
#endif
      if ( timer[i].remaining > timeElapsed ) {
        timer[i].remaining -= timeElapsed;
      } else {
        if ( timer[i].timerType == rtcdrvTimerTypeOneshot ) {
          timer[i].running = false;
#if defined(EMODE_DYNAMIC)
          numOfTimersRunning--;
#endif
        } else {
          // Compensate overdue periodic timers to avoid accumlating errors.
          // Note that, in some cases, the timer can be held up more than twice the time
          // of the periodic timer. This can happen on flash erase for instance or
          // when long interrupt handlers are blocking the RTC interrupt.
          uint64_t previousTick = timeElapsed - timer[i].remaining;
          timer[i].remaining = timer[i].ticks - (previousTick % timer[i].ticks);

          if ( timer[i].periodicCompensationUsec > 0 ) {
            timer[i].periodicDriftUsec += timer[i].periodicCompensationUsec;
            if (timer[i].periodicDriftUsec >= TICK_TIME_USEC) {
              // Add a tick if the timer drift is longer than the time of
              // one tick.
              timer[i].remaining += 1;
              timer[i].periodicDriftUsec -= TICK_TIME_USEC;
            }
          } else {
            timer[i].periodicDriftUsec -= timer[i].periodicCompensationUsec;
            if (timer[i].periodicDriftUsec >= TICK_TIME_USEC) {
              // Subtract one tick if the timer drift is longer than the time
              // of one tick.
              timer[i].remaining -= 1;
              timer[i].periodicDriftUsec -= TICK_TIME_USEC;
            }
          }
        }
        if ( timer[i].callback != NULL ) {
          timer[i].doCallback = true;
        }
      }
    }
  }

#if defined(EMODE_DYNAMIC)
  // If no timers are running, remove block on EM3 and EM4 sleep modes.
  if ( (numOfTimersRunning == 0) && (sleepBlocked == true) ) {
    sleepBlocked = false;
    SLEEP_SleepBlockEnd(sleepEM3);
  }
#endif
}

static void delayTicks(uint32_t ticks)
{
  uint32_t startTime;
  volatile uint32_t now;

  if ( ticks ) {
    startTime = RTC_COUNTERGET();
    do {
      now = RTC_COUNTERGET();
    } while ( TIMEDIFF(now, startTime) < ticks );
  }
}

static void executeTimerCallbacks(void)
{
  int i;

  for ( i = 0; i < EMDRV_RTCDRV_NUM_TIMERS; i++ ) {
    if ( timer[i].doCallback ) {
      timer[i].callback(i, timer[i].user);
    }
  }
}

static void rescheduleRtc(uint32_t rtcCnt)
{
  int i;
  uint64_t min = UINT64_MAX;

  // Find the timer with shortest timeout.
  for ( i = 0; i < EMDRV_RTCDRV_NUM_TIMERS; i++ ) {
    if (    (timer[i].running   == true)
            && (timer[i].remaining <  min) ) {
      min = timer[i].remaining;
    }
  }

  rtcRunning = false;
  if ( min != UINT64_MAX ) {
    min = SL_MIN(min, RTC_CLOSE_TO_MAX_VALUE);
#if defined(RTCDRV_USE_RTC)
    if ( inTimerIRQ == false ) {
      lastStart = (rtcCnt) & RTC_COUNTER_MASK;
    } else
#endif
    {
      lastStart = rtcCnt;
    }
    RTC_INTCLEAR(RTC_COMP_INT);

    RTC_COMPARESET(rtcCnt + min);

#if defined(EMODE_DYNAMIC)
    // When RTC is running, EM3 or EM4 are not allowed.
    if ( sleepBlocked == false ) {
      sleepBlocked = true;
      SLEEP_SleepBlockBegin(sleepEM3);
    }
#endif

    rtcRunning = true;

    // Reenable compare IRQ.
    RTC_INTENABLE(RTC_COMP_INT);
  }
}

#if defined(EMDRV_RTCDRV_WALLCLOCK_CONFIG)
/***************************************************************************//**
 * @brief
 *    Handle counter overflow
 *
 * @note
 *    This function must only be called inside an atomic section.
 ******************************************************************************/
static void handleOverflow(void)
{
  if (RTC_INTGET() & RTC_OF_INT) {
    RTC_INTCLEAR(RTC_OF_INT);
    wallClockOverflowCnt++;
  }
}
#endif

/// @endcond

/* *INDENT-OFF* */
/******** THE REST OF THE FILE IS DOCUMENTATION ONLY !**********************//**
 * @addtogroup emdrv
 * @{
 * @addtogroup RTCDRV
 * @brief Real-time Clock Driver
 * @{

